{
  "provinces": [
    {
      "name": "Antananarivo",
      "description": "Antananarivo is the capital and largest province of Madagascar. It is known for its hilly landscape, with the city of Antananarivo located on the central plateau. The province is a major economic and cultural hub, with various historical sites, markets, and museums to explore.",
      "url": "../images/Antananarivo.jpg",
      "site": ["Rova de Manjakamiadana ","Musée de la photographie","Parc zoologique de Tsimbazaza ","Le Lac Anosy"]
    },
    {
      "name": "Toamasina",
      "description": "Toamasina, also known as Tamatave, is Madagascar's main seaport and the second-largest province. It is located on the eastern coast and is known for its beautiful beaches and vibrant markets. The province is an important center for trade and tourism.",
      "url": "../images/Toamasina.jpg",
      "site": ["Plage de l'Indépendance","Parc Zoologique Ivoloina","Canal des Pangalanes","Plage de Maroantsetra"]
    },
    {
      "name": "Fianarantsoa",
      "description": "Fianarantsoa is a province located in the central highlands of Madagascar. It is known for its picturesque landscapes, terraced rice fields, and the presence of the Ranomafana National Park, a biodiversity hotspot. The city of Fianarantsoa is a center of education and serves as a gateway to exploring the southern part of the island.",
      "url": "../images/.Fianarantsoa.jpg",
      "site": ["Parc National de Ranomafana","Cité Historique d'Ambohimanga","Cathédrale Notre-Dame de Fianarantsoa","Parc National d'Andringitra"]
    },
    {
      "name": "Toliara",
      "description": "Toliara, also known as Tulear, is a province located in the southwestern part of Madagascar. It boasts stunning coastal scenery, including beautiful coral reefs and baobab trees. The province is known for its unique wildlife and is home to the Isalo National Park, offering great opportunities for nature lovers.",
      "url": "../images/Toliara.jpg",
      "site": ["Plage de Ifaty","Réserve de Reniala","Parc National de Tsimanampetsotsa ","Les Dunes de sable de Sarodrano"]
    },
    {
      "name": "Antsiranana",
      "description": "Antsiranana, formerly known as Diego Suarez, is the northernmost province of Madagascar. It is famous for its deep natural harbor and is a significant port for international trade. The province features breathtaking landscapes, including the Amber Mountain National Park and the Tsingy Rouge.",
      "url": "../images/Antsiranana.jpg",
      "site": ["Montagne d'Ambre","Les Trois Baies (Sakalava, Pigeons, Dunes)","Montagne des Français","Tsingy Rouge"]
    },
    {
      "name": "Mahajanga",
      "description": "Majunga is a province located on the northwest coast of Madagascar. It is known for its beautiful beaches, such as Amporaha and Antsanitia, and is a popular destination for water sports enthusiasts. The province's diverse ecosystem includes mangroves, forests, and the Betsiboka River delta.",
      "url": "../images/Mahajanga.jpg",
      "site": ["Allée des Baobabs","Réserve Naturelle d'Amborovy","Plage de Grand Pavois","Parc National de Bemaraha"]
    }
  ]
}
